#pragma once

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// НАСТРОЙКИ ДЕБАГ-РЕЖИМОВ КОМПИЛЯЦИИ
// COMPILE-TIME DEBUG MODES (uncomment any line you wish, if needed)
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//--------------------------------------------------------------------------------------------------------------------------------
// режим отладки Wi-Fi-модуля (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// Wi-Fi module debug mode (Don't use configuration software, only Port Monitor!)
#define WIFI_DEBUG
//--------------------------------------------------------------------------------------------------------------------------------
// режим отладки GSM-модуля (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// GSM module debug mode (Don't use configuration software, only Port Monitor!)
#define GSM_DEBUG_MODE 
//--------------------------------------------------------------------------------------------------------------------------------
// режим отладки модуля логгирования информации (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// LOG module debug mode (Don't use configuration software, only Port Monitor!)
#define LOGGING_DEBUG_MODE
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим модуля полива (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// Watering module debug mode (Don't use configuration software, only Port Monitor!)
#define WATER_DEBUG 
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим nRF, (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// nRF debug mode (Don't use configuration software, only Port Monitor!)
#define NRF_DEBUG
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим LoRa, (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// LoRa debug mode (Don't use configuration software, only Port Monitor!)
#define LORA_DEBUG
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим RS-485, (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// RS-485 debug mode (Don't use configuration software, only Port Monitor!)
#define RS485_DEBUG 
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим универсальных модулей (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
// Universal modules debug mode (Don't use configuration software, only Port Monitor!)
#define UNI_DEBUG 
//--------------------------------------------------------------------------------------------------------------------------------
// Режим отладки модуля pH (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// PH module debug mode (Don't use configuration software, only Port Monitor!)
#define PH_DEBUG 
//--------------------------------------------------------------------------------------------------------------------------------
// Режим отладки модуля IOT (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// IOT module debug mode (Don't use configuration software, only Port Monitor!)
#define IOT_DEBUG
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим провайдеров HTTP-запросов, как правило - надо включать совместно с WIFI_DEBUG (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
// HTTP provider debug mode ). WIFI_DEBUG SHOULD BE defined with this mode!
#define HTTP_DEBUG 
//--------------------------------------------------------------------------------------------------------------------------------
// отладочный режим MQTT (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
#define MQTT_DEBUG                      // // MQTT debug mode
//--------------------------------------------------------------------------------------------------------------------------------
#define DUE_START_DEBUG                 // отладочный режим старта контроллера - ищем проблемы старта на Due
//--------------------------------------------------------------------------------------------------------------------------------
#define SCENE_DEBUG                     // отладочный режим модуля сценариев

//--------------------------------------------------------------------------------------------------------------------------------
#define WINDOW_MANAGE_DEBUG             // закомментировать для выключения отладочной информации по управлению окнами
//--------------------------------------------------------------------------------------------------------------------------------

#define HEAT_MODULE_DEBUG               // закомментировать для выключения отладочной информации по отоплению
////--------------------------------------------------------------------------------------------------------------------------------
#define SHADOW_MODULE_DEBUG             // закомментировать для выключения отладочной информации по затенению
//--------------------------------------------------------------------------------------------------------------------------------
//#define DEBUG_MEASURE_UPDATE_TIME       // закомментировать для выключения проверки быстродействия (КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
//--------------------------------------------------------------------------------------------------------------------------------
#define CYCLE_VENT_DEBUG                // отладочный режим модуля циклической вентиляции
//--------------------------------------------------------------------------------------------------------------------------------
#define VENT_DEBUG                      // отладочный режим модуля вентиляции по температуре
//--------------------------------------------------------------------------------------------------------------------------------
#define DS18B20_DEBUG                   // отладочный режим опроса DS18B20
//--------------------------------------------------------------------------------------------------------------------------------
#define THERMOSTAT_DEBUG                // отладочный режим модуля термостатов
//--------------------------------------------------------------------------------------------------------------------------------
#define POWER_DEBUG                     // отладочный режим управления питанием
//--------------------------------------------------------------------------------------------------------------------------------
#define HUMIDITY_SPRAY_DEBUG            // отладочный режим управление распрыскиванием для поддержания влажности
//--------------------------------------------------------------------------------------------------------------------------------
#define WATER_TANK_MODULE_DEBUG         // отладочный режим модуля контроля уровня воды, закомментировать, если в нём нет необходимости(КОНФИГУРАТОР НЕ РАЗРЕШЕНО ЗАПУСКАТЬ, ПОРТ ОТЛАДОЧНОЙ ИНФОРМАЦИИ)
//--------------------------------------------------------------------------------------------------------------------------------
#define MISOL_DEBUG                     // отладочный режим модуля метеостанции Misol
//--------------------------------------------------------------------------------------------------------------------------------
#define SOIL_MOISTURE_MODULE_DEBUG      // отладочный режим датчиков влажности почвы
//--------------------------------------------------------------------------------------------------------------------------------
#define ONE_WIRE_EMULATION_MODULE_DEBUG // отладочный режим эмулятора 1 Ware
//--------------------------------------------------------------------------------------------------------------------------------
#define DRAINING_DEBUG                  // отладочный режим модуля осушения
//--------------------------------------------------------------------------------------------------------------------------------
#define MCP_DEBUG                      // отладочный режим модуля расширения портов
//--------------------------------------------------------------------------------------------------------------------------------
