/*
    Name:       SensorSTM32F103_25_03_24_05.ino
    Created:	24.03.2025 15:15:55
    Author:     MASTER\Alex
*/

#include "BH1750.h"
#include "UniGlobals.h"
#include "Si7021Support.h"
#include "DHTSupport.h"
#include "SHT1x.h"
#include "OneWireSTM.h"
#include <EEPROM.h>



//----------------------------------------------------------------------------------------------------------------
#define _DEBUG // раскомментировать для отладочного режима (плюётся в Serial, не использовать с подключённым RS-485 !!!)
//----------------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------
// настройки LoRa
//----------------------------------------------------------------------------------------------------------------
#define USE_LORA                       // закомментировать, если не надо работать через LoRa.

#define LORA_SS_PIN PA4                 // пин SS для LoRa
#define LORA_RESET_PIN PB0              // пин Reset для LoRa
#define LORA_FREQUENCY 868E6          // частота работы (433E6, 868E6, 915E6)
#define LORA_TX_POWER 17              // мощность передатчика (1 - 17)
#define LORA_POWER_PIN PB13

 //----------------------------------------------------------------------------------------------------------------
 // настройки RS-485
 //----------------------------------------------------------------------------------------------------------------
 //#define USE_RS485_GATE // закомментировать, если не нужна работа через RS-485
 //----------------------------------------------------------------------------------------------------------------
#define RS485_SPEED 57600 // скорость работы по RS-485
#define RS485_DE_PIN PC14 //v номер пина, на котором будем управлять направлением приём/передача по RS-485



void setup()
{


}

void loop()
{


}
